programming_words =  {'Переменные': 'это простейшая именованная структура данных, в которой может быть сохранён промежуточный или конечный результат работы программы.',
'Строки': 'это тип данных, предназначенный для работы с текстом.',
'Списки': 'это упорядоченная, изменяемая коллекция объектов разных типов.',
'Кортежи': 'это неизменяемые структуры данных, состоящие из элементов одного или разных типов.',
'Словари': 'изменяемые структуры данных, предназначенных для объединения взаимосвязанной информации.'}
for word, interpretation in programming_words.items():
    print(f"\nWord: {word}")
    print(f"\nInterpretation: {interpretation}")
